; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p8---int100n150-m25---int100c150---s124---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level6 level6)
(sum level0 level12 level12)
(sum level0 level13 level13)
(sum level0 level15 level15)
(sum level0 level16 level16)
(sum level0 level25 level25)
(sum level1 level1 level2)
(sum level1 level6 level7)
(sum level1 level12 level13)
(sum level1 level13 level14)
(sum level1 level15 level16)
(sum level1 level16 level17)
(sum level1 level25 level26)
(sum level2 level1 level3)
(sum level2 level6 level8)
(sum level2 level12 level14)
(sum level2 level13 level15)
(sum level2 level15 level17)
(sum level2 level16 level18)
(sum level2 level25 level27)
(sum level3 level1 level4)
(sum level3 level6 level9)
(sum level3 level12 level15)
(sum level3 level13 level16)
(sum level3 level15 level18)
(sum level3 level16 level19)
(sum level3 level25 level28)
(sum level4 level1 level5)
(sum level4 level6 level10)
(sum level4 level12 level16)
(sum level4 level13 level17)
(sum level4 level15 level19)
(sum level4 level16 level20)
(sum level4 level25 level29)
(sum level5 level1 level6)
(sum level5 level6 level11)
(sum level5 level12 level17)
(sum level5 level13 level18)
(sum level5 level15 level20)
(sum level5 level16 level21)
(sum level5 level25 level30)
(sum level6 level1 level7)
(sum level6 level6 level12)
(sum level6 level12 level18)
(sum level6 level13 level19)
(sum level6 level15 level21)
(sum level6 level16 level22)
(sum level6 level25 level31)
(sum level7 level1 level8)
(sum level7 level6 level13)
(sum level7 level12 level19)
(sum level7 level13 level20)
(sum level7 level15 level22)
(sum level7 level16 level23)
(sum level7 level25 level32)
(sum level8 level1 level9)
(sum level8 level6 level14)
(sum level8 level12 level20)
(sum level8 level13 level21)
(sum level8 level15 level23)
(sum level8 level16 level24)
(sum level8 level25 level33)
(sum level9 level1 level10)
(sum level9 level6 level15)
(sum level9 level12 level21)
(sum level9 level13 level22)
(sum level9 level15 level24)
(sum level9 level16 level25)
(sum level9 level25 level34)
(sum level10 level1 level11)
(sum level10 level6 level16)
(sum level10 level12 level22)
(sum level10 level13 level23)
(sum level10 level15 level25)
(sum level10 level16 level26)
(sum level10 level25 level35)
(sum level11 level1 level12)
(sum level11 level6 level17)
(sum level11 level12 level23)
(sum level11 level13 level24)
(sum level11 level15 level26)
(sum level11 level16 level27)
(sum level11 level25 level36)
(sum level12 level1 level13)
(sum level12 level6 level18)
(sum level12 level12 level24)
(sum level12 level13 level25)
(sum level12 level15 level27)
(sum level12 level16 level28)
(sum level12 level25 level37)
(sum level13 level1 level14)
(sum level13 level6 level19)
(sum level13 level12 level25)
(sum level13 level13 level26)
(sum level13 level15 level28)
(sum level13 level16 level29)
(sum level13 level25 level38)
(sum level14 level1 level15)
(sum level14 level6 level20)
(sum level14 level12 level26)
(sum level14 level13 level27)
(sum level14 level15 level29)
(sum level14 level16 level30)
(sum level14 level25 level39)
(sum level15 level1 level16)
(sum level15 level6 level21)
(sum level15 level12 level27)
(sum level15 level13 level28)
(sum level15 level15 level30)
(sum level15 level16 level31)
(sum level15 level25 level40)
(sum level16 level1 level17)
(sum level16 level6 level22)
(sum level16 level12 level28)
(sum level16 level13 level29)
(sum level16 level15 level31)
(sum level16 level16 level32)
(sum level16 level25 level41)
(sum level17 level1 level18)
(sum level17 level6 level23)
(sum level17 level12 level29)
(sum level17 level13 level30)
(sum level17 level15 level32)
(sum level17 level16 level33)
(sum level17 level25 level42)
(sum level18 level1 level19)
(sum level18 level6 level24)
(sum level18 level12 level30)
(sum level18 level13 level31)
(sum level18 level15 level33)
(sum level18 level16 level34)
(sum level18 level25 level43)
(sum level19 level1 level20)
(sum level19 level6 level25)
(sum level19 level12 level31)
(sum level19 level13 level32)
(sum level19 level15 level34)
(sum level19 level16 level35)
(sum level19 level25 level44)
(sum level20 level1 level21)
(sum level20 level6 level26)
(sum level20 level12 level32)
(sum level20 level13 level33)
(sum level20 level15 level35)
(sum level20 level16 level36)
(sum level20 level25 level45)
(sum level21 level1 level22)
(sum level21 level6 level27)
(sum level21 level12 level33)
(sum level21 level13 level34)
(sum level21 level15 level36)
(sum level21 level16 level37)
(sum level21 level25 level46)
(sum level22 level1 level23)
(sum level22 level6 level28)
(sum level22 level12 level34)
(sum level22 level13 level35)
(sum level22 level15 level37)
(sum level22 level16 level38)
(sum level22 level25 level47)
(sum level23 level1 level24)
(sum level23 level6 level29)
(sum level23 level12 level35)
(sum level23 level13 level36)
(sum level23 level15 level38)
(sum level23 level16 level39)
(sum level23 level25 level48)
(sum level24 level1 level25)
(sum level24 level6 level30)
(sum level24 level12 level36)
(sum level24 level13 level37)
(sum level24 level15 level39)
(sum level24 level16 level40)
(sum level24 level25 level49)
(sum level25 level1 level26)
(sum level25 level6 level31)
(sum level25 level12 level37)
(sum level25 level13 level38)
(sum level25 level15 level40)
(sum level25 level16 level41)
(sum level25 level25 level50)
(sum level26 level1 level27)
(sum level26 level6 level32)
(sum level26 level12 level38)
(sum level26 level13 level39)
(sum level26 level15 level41)
(sum level26 level16 level42)
(sum level26 level25 level51)
(sum level27 level1 level28)
(sum level27 level6 level33)
(sum level27 level12 level39)
(sum level27 level13 level40)
(sum level27 level15 level42)
(sum level27 level16 level43)
(sum level27 level25 level52)
(sum level28 level1 level29)
(sum level28 level6 level34)
(sum level28 level12 level40)
(sum level28 level13 level41)
(sum level28 level15 level43)
(sum level28 level16 level44)
(sum level28 level25 level53)
(sum level29 level1 level30)
(sum level29 level6 level35)
(sum level29 level12 level41)
(sum level29 level13 level42)
(sum level29 level15 level44)
(sum level29 level16 level45)
(sum level29 level25 level54)
(sum level30 level1 level31)
(sum level30 level6 level36)
(sum level30 level12 level42)
(sum level30 level13 level43)
(sum level30 level15 level45)
(sum level30 level16 level46)
(sum level30 level25 level55)
(sum level31 level1 level32)
(sum level31 level6 level37)
(sum level31 level12 level43)
(sum level31 level13 level44)
(sum level31 level15 level46)
(sum level31 level16 level47)
(sum level31 level25 level56)
(sum level32 level1 level33)
(sum level32 level6 level38)
(sum level32 level12 level44)
(sum level32 level13 level45)
(sum level32 level15 level47)
(sum level32 level16 level48)
(sum level32 level25 level57)
(sum level33 level1 level34)
(sum level33 level6 level39)
(sum level33 level12 level45)
(sum level33 level13 level46)
(sum level33 level15 level48)
(sum level33 level16 level49)
(sum level33 level25 level58)
(sum level34 level1 level35)
(sum level34 level6 level40)
(sum level34 level12 level46)
(sum level34 level13 level47)
(sum level34 level15 level49)
(sum level34 level16 level50)
(sum level34 level25 level59)
(sum level35 level1 level36)
(sum level35 level6 level41)
(sum level35 level12 level47)
(sum level35 level13 level48)
(sum level35 level15 level50)
(sum level35 level16 level51)
(sum level35 level25 level60)
(sum level36 level1 level37)
(sum level36 level6 level42)
(sum level36 level12 level48)
(sum level36 level13 level49)
(sum level36 level15 level51)
(sum level36 level16 level52)
(sum level36 level25 level61)
(sum level37 level1 level38)
(sum level37 level6 level43)
(sum level37 level12 level49)
(sum level37 level13 level50)
(sum level37 level15 level52)
(sum level37 level16 level53)
(sum level37 level25 level62)
(sum level38 level1 level39)
(sum level38 level6 level44)
(sum level38 level12 level50)
(sum level38 level13 level51)
(sum level38 level15 level53)
(sum level38 level16 level54)
(sum level38 level25 level63)
(sum level39 level1 level40)
(sum level39 level6 level45)
(sum level39 level12 level51)
(sum level39 level13 level52)
(sum level39 level15 level54)
(sum level39 level16 level55)
(sum level39 level25 level64)
(sum level40 level1 level41)
(sum level40 level6 level46)
(sum level40 level12 level52)
(sum level40 level13 level53)
(sum level40 level15 level55)
(sum level40 level16 level56)
(sum level40 level25 level65)
(sum level41 level1 level42)
(sum level41 level6 level47)
(sum level41 level12 level53)
(sum level41 level13 level54)
(sum level41 level15 level56)
(sum level41 level16 level57)
(sum level41 level25 level66)
(sum level42 level1 level43)
(sum level42 level6 level48)
(sum level42 level12 level54)
(sum level42 level13 level55)
(sum level42 level15 level57)
(sum level42 level16 level58)
(sum level42 level25 level67)
(sum level43 level1 level44)
(sum level43 level6 level49)
(sum level43 level12 level55)
(sum level43 level13 level56)
(sum level43 level15 level58)
(sum level43 level16 level59)
(sum level43 level25 level68)
(sum level44 level1 level45)
(sum level44 level6 level50)
(sum level44 level12 level56)
(sum level44 level13 level57)
(sum level44 level15 level59)
(sum level44 level16 level60)
(sum level44 level25 level69)
(sum level45 level1 level46)
(sum level45 level6 level51)
(sum level45 level12 level57)
(sum level45 level13 level58)
(sum level45 level15 level60)
(sum level45 level16 level61)
(sum level45 level25 level70)
(sum level46 level1 level47)
(sum level46 level6 level52)
(sum level46 level12 level58)
(sum level46 level13 level59)
(sum level46 level15 level61)
(sum level46 level16 level62)
(sum level46 level25 level71)
(sum level47 level1 level48)
(sum level47 level6 level53)
(sum level47 level12 level59)
(sum level47 level13 level60)
(sum level47 level15 level62)
(sum level47 level16 level63)
(sum level47 level25 level72)
(sum level48 level1 level49)
(sum level48 level6 level54)
(sum level48 level12 level60)
(sum level48 level13 level61)
(sum level48 level15 level63)
(sum level48 level16 level64)
(sum level48 level25 level73)
(sum level49 level1 level50)
(sum level49 level6 level55)
(sum level49 level12 level61)
(sum level49 level13 level62)
(sum level49 level15 level64)
(sum level49 level16 level65)
(sum level50 level1 level51)
(sum level50 level6 level56)
(sum level50 level12 level62)
(sum level50 level13 level63)
(sum level50 level15 level65)
(sum level50 level16 level66)
(sum level51 level1 level52)
(sum level51 level6 level57)
(sum level51 level12 level63)
(sum level51 level13 level64)
(sum level51 level15 level66)
(sum level51 level16 level67)
(sum level52 level1 level53)
(sum level52 level6 level58)
(sum level52 level12 level64)
(sum level52 level13 level65)
(sum level52 level15 level67)
(sum level52 level16 level68)
(sum level53 level1 level54)
(sum level53 level6 level59)
(sum level53 level12 level65)
(sum level53 level13 level66)
(sum level53 level15 level68)
(sum level53 level16 level69)
(sum level54 level1 level55)
(sum level54 level6 level60)
(sum level54 level12 level66)
(sum level54 level13 level67)
(sum level54 level15 level69)
(sum level54 level16 level70)
(sum level55 level1 level56)
(sum level55 level6 level61)
(sum level55 level12 level67)
(sum level55 level13 level68)
(sum level55 level15 level70)
(sum level55 level16 level71)
(sum level56 level1 level57)
(sum level56 level6 level62)
(sum level56 level12 level68)
(sum level56 level13 level69)
(sum level56 level15 level71)
(sum level56 level16 level72)
(sum level57 level1 level58)
(sum level57 level6 level63)
(sum level57 level12 level69)
(sum level57 level13 level70)
(sum level57 level15 level72)
(sum level57 level16 level73)
(sum level58 level1 level59)
(sum level58 level6 level64)
(sum level58 level12 level70)
(sum level58 level13 level71)
(sum level58 level15 level73)
(sum level59 level1 level60)
(sum level59 level6 level65)
(sum level59 level12 level71)
(sum level59 level13 level72)
(sum level60 level1 level61)
(sum level60 level6 level66)
(sum level60 level12 level72)
(sum level60 level13 level73)
(sum level61 level1 level62)
(sum level61 level6 level67)
(sum level61 level12 level73)
(sum level62 level1 level63)
(sum level62 level6 level68)
(sum level63 level1 level64)
(sum level63 level6 level69)
(sum level64 level1 level65)
(sum level64 level6 level70)
(sum level65 level1 level66)
(sum level65 level6 level71)
(sum level66 level1 level67)
(sum level66 level6 level72)
(sum level67 level1 level68)
(sum level67 level6 level73)
(sum level68 level1 level69)
(sum level69 level1 level70)
(sum level70 level1 level71)
(sum level71 level1 level72)
(sum level72 level1 level73)

(connected l0 l1)
(fuelcost level25 l0 l1)
(connected l0 l2)
(fuelcost level6 l0 l2)
(connected l0 l4)
(fuelcost level13 l0 l4)
(connected l1 l0)
(fuelcost level25 l1 l0)
(connected l1 l2)
(fuelcost level12 l1 l2)
(connected l1 l3)
(fuelcost level1 l1 l3)
(connected l1 l4)
(fuelcost level16 l1 l4)
(connected l2 l0)
(fuelcost level6 l2 l0)
(connected l2 l1)
(fuelcost level12 l2 l1)
(connected l2 l4)
(fuelcost level15 l2 l4)
(connected l3 l1)
(fuelcost level1 l3 l1)
(connected l4 l0)
(fuelcost level13 l4 l0)
(connected l4 l1)
(fuelcost level16 l4 l1)
(connected l4 l2)
(fuelcost level15 l4 l2)

(at t0 l1)
(fuel t0 level73)
(= (total-cost) 0)

(at p0 l2)
(at p1 l2)
(at p2 l4)
(at p3 l3)
(at p4 l1)
(at p5 l4)
(at p6 l1)
(at p7 l2)
)

(:goal
(and
(at p0 l1)
(at p1 l1)
(at p2 l0)
(at p3 l1)
(at p4 l4)
(at p5 l2)
(at p6 l0)
(at p7 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 8
2. (drive t0 l1 l4 level57 level16 level73)
   deleted: (at t0 l1) (fuel t0 level73)
   added: (at t0 l4) (fuel t0 level57)
   goals met: 0 of 8
3. (unload p4 t0 l4)
   deleted: (in p4 t0)
   added: (at p4 l4)
   goals met: 1 of 8
4. (load p5 t0 l4)
   deleted: (at p5 l4)
   added: (in p5 t0)
   goals met: 1 of 8
5. (load p2 t0 l4)
   deleted: (at p2 l4)
   added: (in p2 t0)
   goals met: 1 of 8
6. (drive t0 l4 l2 level42 level15 level57)
   deleted: (at t0 l4) (fuel t0 level57)
   added: (at t0 l2) (fuel t0 level42)
   goals met: 1 of 8
7. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 2 of 8
8. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 2 of 8
9. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 2 of 8
10. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 2 of 8
11. (drive t0 l2 l1 level30 level12 level42)
   deleted: (at t0 l2) (fuel t0 level42)
   added: (at t0 l1) (fuel t0 level30)
   goals met: 2 of 8
12. (drive t0 l1 l3 level29 level1 level30)
   deleted: (at t0 l1) (fuel t0 level30)
   added: (at t0 l3) (fuel t0 level29)
   goals met: 2 of 8
13. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 2 of 8
14. (drive t0 l3 l1 level28 level1 level29)
   deleted: (at t0 l3) (fuel t0 level29)
   added: (at t0 l1) (fuel t0 level28)
   goals met: 2 of 8
15. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 2 of 8
16. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 3 of 8
17. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 4 of 8
18. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 5 of 8
19. (unload p7 t0 l1)
   deleted: (in p7 t0)
   added: (at p7 l1)
   goals met: 6 of 8
20. (drive t0 l1 l0 level3 level25 level28)
   deleted: (at t0 l1) (fuel t0 level28)
   added: (at t0 l0) (fuel t0 level3)
   goals met: 6 of 8
21. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 7 of 8
22. (unload p6 t0 l0)
   deleted: (in p6 t0)
   added: (at p6 l0)
   goals met: 8 of 8
